Repository: EnterpriseDB/barman
Catalog: po/*.po
Languages: es

source: (inactive)
es: (inactivo)

source: (WARNING: disabled)
es: (ADVERTENCIA: deshabilitado)

source: specifies the server names for the backup command ('all' will show all available servers)
es: especifica los nombres de servidor para el comando de copia de seguridad ('all' se mostrarán todosservidores disponibles)

source: forces the initial checkpoint to be done as quickly as possible
es: obliga a que el check point inicial se realice lo más rápido posible

source: forces the initial checkpoint to be spreaded
es: fuerza el punto de control inicial para ser propagado

source: use the previous backup to improve transfer-rate. If no argument is given "link" is assumed
es: use la copia de seguridad anterior para mejorar la velocidad de transferencia. Si no se da ningún argumento se asume "enlace"

source: Number of retries after an error if base backup copy fails.
es: Número de reintentos después de un error si la copia de seguridad base falla.

source: Wait time after a failed base backup copy, before retrying.
es: Tiempo de espera después de una copia de seguridad base fallida, antes de volver a intentarlo.

source: Disable base backup copy retry logic.
es: Desactivar la lógica de reintento de la copia de respaldo de la base

source: Run the copy in parallel using NJOBS processes.
es: Ejecuta la copia en paralelo usando procesos NJOBS

source: specifies the server name for the command ('all' will show all available servers)
es: especifica el nombre del servidor para el comando ('all' mostrará todos los servidores disponibles)

source: target time. You can use any valid unambiguous representation. e.g: "YYYY-MM-DD HH:MM:SS.mmm"
es: tiempo objetivo. Puede usar cualquier representación inequívoca válida. Por ejemplo: "YYYY-MM-DD HH:MM:SS.mmm"

source: target name created previously with pg_create_restore_point() function call
es: nombre de destino creado previamente con la llamada de función pg_create_restore_point ()

source: end recovery as soon as a consistent state is reached
es: recuperación final tan pronto como se alcanza un estado consistente

source: set target xid to be non inclusive
es: establecer el objetivo xid para que no sea inclusivo

source: tablespace relocation rule
es: Regla de reubicación del tablespace

source: specifies the backup ID to recover
es: especifica la ID de la copia de seguridad para recuperar

source: the directory where the new server is created
es: el directorio donde se crea el nuevo servidor

source: Enable the get-wal option during the recovery.
es: Habilita la opción get-wal durante la recuperación.

source: Disable the get-wal option during recovery.
es: Desactiva la opción get-wal durante la recuperación.

source: Enable network compression during remote recovery.
es: Habilitar la compresión de red durante la recuperación remota.

source: Disable network compression during remote recovery.
es: Desactiva la compresión de red durante la recuperación remota.

source: Enable standby mode when starting the recovered PostgreSQL instance
es: Habilitar el modo standby al iniciar la instancia de PostgreSQL recuperada

source: Cannot recover from backup '%s' of server '%s': backup status is not DONE
es: No se puede recuperar de la copia de seguridad '%s' del servidor '%s': el estado de la copia de seguridad no es COMPLETADO

source: Invalid tablespace relocation rule '%s' HINT: The valid syntax for a relocation rule is NAME:LOCATION
es: Sintaxis de reubicación del tablespace no válida '%s' SUGERENCIA: la sintaxis válida para una regla de reubicación es NAME: LOCATION

source: Invalid tablespace name '%s' HINT: Please use any of the following tablespaces: %s
es: Nombre de espacio de tabla no válido '%s' SUGERENCIA: Por favor use alguno de los siguientes tablespaces: %s

source: The destination directory parameter cannot contain the ':' character HINT: If you want to do a remote recovery you have to use the --remote-ssh-command option
es: El parámetro del directorio de destino no puede contener el carácter ':' CONSEJO: Si quieres hacer una recuperación remota, tienes que usar la opción --remote-ssh-command

source: You cannot specify multiple targets for the recovery operation
es: No se pueden especificar objetivos múltiples para la operación de recuperación

source: Network compression can only be used with remote recovery. HINT: If you want to do a remote recovery you have to use the --remote-ssh-command option
es: La compresión de red solo se puede usar con recuperación remota. CONSEJO: Si quieres hacer una recuperación remota, tienes que usar la opción --remote-ssh-command

source: specifies the server names to show ('all' will show all available servers)
es: especifica los nombres de servidor para mostrar ('all' mostrará todos los servidores disponibles)

source: specifies the server name target of the switch-wal command
es: especifica el destino del nombre del servidor del comando switch-wal

source: forces the switch of a WAL by executing a checkpoint before
es: fuerza el cambio de un WAL ejecutando antes un checkpoint

source: wait for one WAL file to be archived
es: espera que se archive un archivo WAL

source: the time, in seconds, the archiver will wait for a new WAL file to be archived before timing out
es: el tiempo, en segundos, el archivador esperará a que aparezca un nuevo archivo WALantes de agotar el tiempo de archivado

source: specifies the server names to check ('all' will check all available servers)
es: specifica los nombres de los servidores a verificar ('all' verificará todos los servidores disponibles)

source: Nagios plugin compatible output
es: Salida compatible con el plugin Nagios

source: invalid xlog segment name %r HINT: Please run "barman rebuild-xlogdb %s" to solve this issue
es: nombre de segmento xlog inválidoSugerencia: Ejecute "barman rebuild-xlogdb %s" para resolver este problema

source: Cannot delete backup (%s %s)
es: No se puede borrar la copia de seguridad (%s %s)

source: put the retrieved WAL file in this directory with the original name
es: poner el archivo WAL recuperado en este directorio con el nombre original

source: compress the output with gzip
es: comprime la salida con gzip

source: compress the output with bzip2
es: comprime la salida con bzip2

source: stop the receive-wal subprocess for the server
es: detener el subproceso de recepción-wal para el servidor

source: reset the status of receive-wal removing any status files
es: restablecer el estado de wal de recepción eliminando cualquier archivo de estado

source: create the replication slot, if it does not exist
es: crea el replication slot, si no existe

source: drop the replication slot, if it exists
es: elimina el replication slot, si existe

source: --stop and --reset options are not compatible
es: las opciones --top y --reset no son compatibles

source: ERROR: please run barman as %r user
es: ERROR: ejecuta barman como usuario %r

source: ERROR: the configured user %r does not exists
es: ERROR: el usuario configurado %r no existe

source: You cannot use 'all' with other server names
es: No se puede usar 'all' con otros nombres de servidor

source: Skipping inactive server '%s'
es: Omitiendo el servidor inactivo '%s

source: Skipping temporarily disabled server '%s'
es: Omitiendo el servidor temporalmente desactivado '%s'

source: Unknown server '%s'
es: Servidor desconocido '%s'

source: Inactive server: %s
es: Servidor inactivo: %s

source: uses a configuration file (defaults: %s)
es: usa un archivo de configuración (por defecto: %s)

source: Process interrupted by user (KeyboardInterrupt)
es: Proceso interrumpido por el usuario (KeyboardInterrupt)

source: %s See log file for more details.
es: %s Ver el archivo de logs para más detalles
